tutorials/rhopSonicFoam/wedge15Ma5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/dm2/henry/OpenFOAM/OpenFOAM-1.4.1/tutorials/rhopSonicFoam";
    case "wedge15Ma5";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
inlet
{
    type patch;
    nFaces 40;
    startFace 9440;
}

outlet
{
    type patch;
    nFaces 40;
    startFace 9480;
}

bottom
{
    type symmetryPlane;
    nFaces 40;
    startFace 9520;
}

top
{
    type symmetryPlane;
    nFaces 120;
    startFace 9560;
}

obstacle
{
    type patch;
    nFaces 80;
    startFace 9680;
}

defaultFaces
{
    type empty;
    nFaces 9600;
    startFace 9760;
}
)

// ************************************************************************* //
